# Напишите программу, которая на вход принимает два числа A и B,
# и возводит число А в целую степень B с помощью рекурсии.

# *Пример:*

# A = 3; B = 5 -> 243 (3⁵)
# A = 2; B = 3 -> 8 

a = int(input('Введите число: '))
b = int(input('Введите степень: '))
def pow(a, b):
    if b == 0:
        return 1
    return pow(a, b - 1) * a
print('Result: ', pow(a, b))

# Напишите рекурсивную функцию sum(a, b),
# возвращающую сумму двух целых неотрицательных чисел.
# Из всех арифметических операций допускаются только +1 и -1.
# Также нельзя использовать циклы.

# *Пример:*

# 2 2
#     4 

def rec_sum(a, b):
    if b == 0:
        return a
    return rec_sum(a + 1, b - 1)
n = int(input("Введите число а: "))
m = int(input("Введите число б: "))
print("Сумма а и б: ", rec_sum(n, m))